[{"title":"Voice and Memory","slug":"voice-and-memory","date":"2019-01-30T00:00:00.000Z","tags":null,"summary":"This text is a short portrait of my feelings on the intersection of two interesting topics, both related to the way our brains work."},{"title":"Year of the Pig","slug":"year-of-the-pig","date":"2019-02-26T00:00:00.000Z","tags":null,"summary":"Iberian tradition has it that, upon its killing on Saint Martin's day, no part of the pig's body shall go to waste. From the snout to the tail, every bowel, leg, and bone can be given a use."},{"title":"Power of Will","slug":"power-of-will","date":"2019-03-31T00:00:00.000Z","tags":null,"summary":"Every morning I overcome (to different degrees of success) the waking up ritual. I manage to get up, sit on my bed, and then finally leave altogether."},{"title":"Keep Calm and Carry On (Unironically)","slug":"keep-calm-and-carry-on","date":"2019-04-30T00:00:00.000Z","tags":null,"summary":"This famous British WWII-era phrase may have been rendered meaningless by contemporary abuse. But its literal message can still be revived as a mantra for... well, keeping calm and carrying on, with an accent on a particular application."},{"title":"Dirty Spot","slug":"dirty-spot","date":"2019-05-31T00:00:00.000Z","tags":null,"summary":"You know the spot between the bed and the wall? Or the one behind that cabinet you never move? Or the one under the sofa where you never look?"},{"title":"Why I Need Pride","slug":"why-i-need-pride","date":"2019-06-28T00:00:00.000Z","tags":null,"summary":"A good friend of mine likes to say, \"it's pride as in the opposite of shame\", i.e., not as a feeling of vanity or superiority."},{"title":"A Living Memory of the Lingering Present","slug":"a-living-memory-of-the-lingering-present","date":"2019-07-30T00:00:00.000Z","tags":null,"summary":"Anyone who knows me well will know that I love the city of Barcelona. It's got a charm that just gets into your heart. But there is something it will never be: my childhood town."},{"title":"Moving on Backwards","slug":"moving-on-backwards","date":"2019-08-29T00:00:00.000Z","tags":null,"summary":"Peer presure can be one hell of a behavior driver."},{"title":"Impostor","slug":"impostor","date":"2019-09-29T00:00:00.000Z","tags":null,"summary":"\"Who am I?\" is a question one can pose to themself quite often, specially in other, more subtle forms."},{"title":"Force of Habit","slug":"force-of-habit","date":"2019-10-15T00:00:00.000Z","tags":null,"summary":"This month, as I did last year, I've taken on the Inktober challenge, which consists of making a drawing every day of the month following a prompt each."},{"title":"The Tale with the Girl","slug":"the-tale-with-the-girl","date":"2019-11-29T00:00:00.000Z","tags":null,"summary":"I once met this strange girl on the street, the popular-looking, obnoxious kind."},{"title":"The Trial","slug":"the-trial","date":"2019-12-03T00:00:00.000Z","tags":null,"summary":"The following is Anna Brullas' (illustration) and my (text) collaborative entry to the 2019 edition of the artistic contest Arroz Negro, organized by Barcelona's cultural magazine BCN Més."},{"title":"Decade in Review","slug":"decade-in-review","date":"2019-12-29T00:00:00.000Z","tags":null,"summary":"It seems a little bit surreal to me that only ten years ago I was starting middle school. I started the decade 12 and will be finishing it 22, an age range that may contain some of the boldest moments in the development of any person."},{"title":"Fever Dream","slug":"fever-dream","date":"2020-02-26T00:00:00.000Z","tags":null,"summary":"When I was just a kid, and things got scary, I would climb up to my bed and hide under the covers."},{"title":"Game of Life","slug":"game-of-life","date":"2020-09-25T00:00:00.000Z","tags":null,"summary":"TODO"}]