{"html":"<p>It seems a little bit surreal to me that only ten years ago I was starting middle school. I started the decade 12 and will be finishing it 22, an age range that may contain some of the boldest moments in the development of any person.</p>\n<p>As with most things, time is relative. I want to illustrate to what extent it's hard to figure how long things actually take, so I will measure a few milestones in relationship to the length of the decade.</p>\n<h2 id=\"education\">Education</h2>\n<p>As I said, I was in seventh grade when the 2010s started. In Spain that's first of ESO (compulsory secondary education), a program that lasts four years before going into the last two years of high school, known as <em>bachillerato</em>.</p>\n<p>The following year I entered a double degree in Mathematics and Computer Engineering by the University of Barcelona. Although the degree is supposed to be finished in five and a half years (11 four-month terms), I might manage to complete it in ten terms, or five academic years.</p>\n<p>That means that I've spent about <strong>60% of the decade</strong> in <strong>secondary education</strong> and <strong>40%</strong> in <strong>tertiary education</strong>. This fact alone boggles my mind because, from my perspective, being at uni still feels new.</p>\n<p>Each university credit is equivalent to, in theory, 25 hours of work (counting both work in class and at home). I'm a month shy of completing my ninth term, so I'll count that too. At six credits per course, five or six courses per term, I've almost reached 7500 <strong>hours of university study</strong>, which is an <strong>8.5%</strong> of the ten year period. That's… a lot more than I expected, actually. That's about two hours a day every day for ten years! Or four hours every day if we count only the time I've been attending uni.</p>\n<p>For the last four and a half or so years I've also been attending <strong>Mandarin classes</strong>, about 540 hours or <strong>0.6%</strong> of ten years.</p>\n<h2 id=\"work\">Work</h2>\n<p>Although they are technically not an employment, I'll count the two internships I've taken towards this section because they may not be a job but they sure as hell felt like one.</p>\n<p>I started my first internship in late 2017, which means that I've spent the last two years <strong>working</strong> almost uninterruptedly—except for a month in summer of 2018 and a couple of weeks in June this year. That amounts to about a little under <strong>20%</strong> of the decade.</p>\n<p>I did some back-of-the-envelope math to figure how much actual <strong>time I've spent at work</strong>. The rough total is 1770 hours, which is just about <strong>2%</strong> of the decade. Could be way worse.</p>\n<h2 id=\"travel\">Travel</h2>\n<p>In the last ten years I've been to the UK, China, Andorra, France, and Germany, for a total of 35 days or <strong>0.9%</strong> of the whole period <strong>abroad</strong>.</p>\n<h2 id=\"personal-life\">Personal life</h2>\n<p>Although there's always been doubt in my mind, I started to seriously question my sexuality at the beginning of my second-to-last high school year, and it wasn't until 2017 that I finally figured it out. That was about four whole years (<strong>40%</strong>) of <strong>self-reflection</strong>, and two years (<strong>20%</strong>) since then of <strong>inner comfort</strong>.</p>\n<p>As of this week I've been for 41 months in a <strong>romantic relationship</strong>. That's about <strong>34%</strong> of the decade.</p>","metadata":{"title":"Decade in Review","slug":"decade-in-review","date":"2019-12-29T00:00:00.000Z","tags":null,"summary":"It seems a little bit surreal to me that only ten years ago I was starting middle school. I started the decade 12 and will be finishing it 22, an age range that may contain some of the boldest moments in the development of any person."},"filename":"20191229-decade-in-review.md","path":"/home/runner/work/website/website/src/routes/blog/_posts/20191229-decade-in-review.md"}