{"html":"<h2 id=\"house\">House</h2>\n<p>You know the spot between the bed and the wall? Or the one behind that cabinet you never move? Or the one under the sofa where you never look?</p>\n<p>My apartment is full of these tiny little places, hidden in plain sight. I'm aware of their existence. I know they get dirty and dusty. A week goes by, I clean up, but I miss this spot. Next time I go dust, I think to myself \"meh, there's no hurry\", and leave it for future me to manage. And so, this process reiterates, reinforcing itself, in a mixture of laziness and shame, leaving that place to gather dirt and spiders.</p>\n<p>Instead of cleaning up once and for all, I wait and wait, and the place gets dirtier and dirtier. And its presence in my consciousness grows and grows.</p>\n<h2 id=\"mind\">Mind</h2>\n<p>Our mind is like a house, and in this regard it can have hidden spots of its own. Sure, it may not seem <em>necessary</em> to deal with this issue with a coworker right now, or to visit your mom this weekend, or to go get checked at the doctor this same month.</p>\n<p>But the thought is there, in some corner of your brain, just gathering dust. And probably nasty spiders as well.</p>\n<p>And, as dumb as the issue is, you start to get anxious over it. Because now it may be too late to deal with it as easily, or it might be too awkward now, or who knows what. And everyday you walk by this cursed spot in your home, and you consciously and knowlingly ignore it. And it reaches a point where it's occupying so much of your mind space that just dealing with it is easier than holding it inside. And even then, we often still do nothing to fix it.</p>\n<p>I remember my first dirty spot as a child. When I was in elementary school, we were given these sheets that were almost blank except for some title and some writing guidelines. I think we were supposed to write a summary of the children version of the Quixote we were reading in class.</p>\n<p>I put the sheet in my backpack carelessly, and over the weeks it got all creased and teared. I was so ashamed, to think that I'd have to hand in something so ugly and unkempt. It gave me horrible anxiety, I remember it being my only worry at the time.</p>\n<p>I forgot how it all turned out. But I think that's a good sign: the worry ended up weighting more than the eventual resolution itself.</p>\n<p>That is my point: most of the times, we remember better the suffering that keeping the issue in our mind brought, than the consequences that it entailed. Try to revisit your old dirty spots and check if this is true for yourself. And, with this revisiting, ask yourself whether it's worth it to ignore this or that one day more.</p>","metadata":{"title":"Dirty Spot","slug":"dirty-spot","date":"2019-05-31T00:00:00.000Z","tags":null},"filename":"20190531-dirty-spot.md","path":"/home/runner/work/website/website/src/routes/blog/_posts/20190531-dirty-spot.md"}