{"html":"<script>\n  const onLoadMathJax = () => {\n    MathJax = {\n      tex: {inlineMath: [['$', '$'], ['\\\\(', '\\\\)']]},\n      svg: {fontCache: 'none'}\n    };\n  };\n</script>\n<p><svelte:head><br />\n  </p>\n<script async src=\"https://cdn.jsdelivr.net/npm/mathjax@3/es5/tex-svg.js\" on:load={onLoadMathJax}></script>\n<p></svelte:head></p>\n<p>When we want to show that something is true, we say that we want to <strong>prove</strong> it. This word is not uncommon. For instance, we say that the accused are proven guilty or innocent in trials.</p>\n<p>In Mathematics, proving something means showing that it must necessarily be true. In essence, a mathematician's job consists of proving statements. Lawyers, scholars, and other scientists do this too, but their methods differ from those of mathematicians in their very nature. Scientists use real-world data to try to support their reasonings and help understand patterns. Mathematicians do no such thing: their proofs are purely logical. Thus, learning how to read and write proofs is an essential part of a mathematician's initial training.</p>\n<p>In this post, I want to briefly showcase the basic tools used by mathematicians for building logically sound proofs.</p>\n<p>And to do that, we'll play Minesweeper.</p>\n<h1 id=\"types-of-proof\">Types of proof</h1>\n<p>Mathematical statements usually take the form of deductive statements: they have a premise, or hypothesis, which we suppose, know, or assume to be true, and our mission is to reach, from them, a conclusion. We can represent this idea with the following notation:</p>\n<p>$p \\implies q$</p>\n<p>There are two basic kinds of proofs: direct and indirect.</p>\n<h2 id=\"direct-proof\">Direct proof</h2>\n<p>A direct proof is that </p>\n<h2 id=\"indirect-proof\">Indirect proof</h2>\n<h2 id=\"case-analysis\">Case analysis</h2>\n<h1 id=\"provability\">Provability</h1>\n<p>Unprovable statements (e.g. a board that cannot be determined).</p>","metadata":{"title":"Proofsweeper","slug":"proofsweeper","date":"2021-05-22T00:00:00.000Z","tags":null,"summary":"TODO","math":true},"filename":"20210522-proofsweeper.md","path":"/home/runner/work/website/website/src/routes/blog/_posts/20210522-proofsweeper.md"}