{"html":"<style>\n  main {\n    --content-width: 150em;\n    width: min(var(--content-width), 100%);\n  }\n  .precontent {\n    display: none\n  }\n  .intro {\n    width: min(52em, 100%);\n    margin: auto;\n    color: grey;\n  }\n  hr {\n    width: min(52em, 100%);\n  }\n  img {\n    transition: transform .2s;\n  }\n  img:hover {\n    transform: scale(2) translate(25%, 72px);\n  }\n  small {\n    color: #777777;\n  }\n</style>\n<div markdown=\"1\" class=\"intro\"><p>The following is Anna Brullas' (illustration) and my (text) collaborative entry to the 2019 edition of the artistic contest <a href=\"https://bcnmes.com/arroznegro/\"><em>Arroz Negro</em></a>, organized by Barcelona's cultural magazine <a href=\"https://bcnmes.com/\">BCN Més</a>. Our entry was one of the 10 winners who were awarded a basket of gifts and published in a special edition in December 2019.<br />\n  <br/></p>\n<p><strong>Anna Brullas</strong> is a very talented illustrator and graphic designer from Tarragona who likes <em>The Little Prince</em> and cacti. You can find her on <a href=\"https://www.etsy.com/shop/AnnaxNeus\">Etsy</a>, <a href=\"https://www.instagram.com/annabrullas/\">Instagram</a>, and <a href=\"https://twitter.com/annabrullas\">Twitter</a>.<br />\n  <br/></p></div>\n  <hr/>\n<div class=\"container\">\n  <div class=\"row\">\n    <div class=\"col-md\">\n      <figure class=\"sticky-top\" style=\"top: 72px; margin: 0;\">\n        <img src=\"illustration.jpg\" width=\"100%\" alt=\"A vertical medium shot portrait of a woman dressed in red judge robes over a light pink background. She is holding a gavel on top of a table in front of her. A smaller, black silhouette of another woman is trapped behind the lines that make up the robes of the judge, as if they were the bars of a prison cell.\"/>\n        <figcaption>Illustration by Anna Brullas</figcaption>\n      </figure>\n    </div>\n    <div class=\"col-md\">\n      <h1>The Trial</h1>\n      <small>2019-12-03</small><br><br>\n      <div style=\"font-family: 'Castoro', serif; text-align: justify;\">\n        <p>In a split second, everything went white. At first it seemed like a bright flash—I even squinted—but it just turned out to be the color of the room I was in. I wasn’t even sure this was a room, after all it didn’t seem to have any walls or ceiling. In the middle of the infinite whiteness, I was sitting at a wooden desk, right next to an identical one where a tall, curly-haired brunette wearing a grey three-piece suit was skimming through some documents. In front of us, from an elevated stand, a middle-aged woman in a long robe and black hair in a bun was presiding the room. Just as I was scanning her with my eyes, she started speaking.</p>\n        <p>“We are today going to review the case of Laura Kingston against Laura Kingston. The accused is facing twenty-two charges of Gluttony, one hundred and thirty-four charges of Sloth…” As the judge kept listing sins, for what felt like five solid minutes, I started to come back to my senses. “… and fifty-seven charges of Grand Lust. How does the accused declare herself?”</p>\n        <p>I looked around, seeking visual clues that effectively confirmed that I was being talked to. Both women, lawyer and judge, stared at me. “N-not guilty,” I responded, with a cracking voice. “Your honor,” I added swiftly.</p>\n        <p>“Okay, the prosecution may then begin.”</p>\n        <p>“Thank you, your honor,” spoke diligently the woman at the desk beside me. “This person”—she pointed at me—“is a danger to society. If everyone acted like she does, the world would not—”</p>\n        <p>“Excuse me,” I interrupted. There was something that made the situation a thousand times weirder than it already was. I asked, “Why are you all… me?”, looking in alternation at the two women: the judge was an older, more serious doppelgänger of the lawyer, and both resembled more successful versions of myself.</p>\n        <p>The judge took a curious look at me. “Well, who else should judge your thoughts and actions?”</p>\n        <p>“And what am I being judged for?”</p>\n        <p>The magistrate leaned forward, crossing her hands. “You, Laura Kingston, have died. And you are being judged for breaking the pact that you made with yourself: to try and be a good person.”</p>\n        <p>“Wait, this is unfair! Nobody told me I’d be judged.”</p>\n        <p>“Didn’t <em>you</em> tell yourself?” she asked. “You knew you were breaking that pact: every time you skipped class, every time you littered in the street, every time you lied to your mother—”</p>\n        <p>“Don’t you dare put my mother into this!”</p>\n        <p>“Please, Ms. Kingston, I must remind you that she was <em>my</em> mother as well. The matter of whether all those…” She checked her files. “… more than two thousand lies are justified or not will be discussed today at this court of the law.”</p>\n        <p>“This is madness.” I stood up slamming my hands on the table. “What law? On what basis?” I started to talk like the crazy one in the courtroom.</p>\n        <p>The judge sounded her gavel, impassively. “In all my twenty-six years judging myself, I’ve never encountered such a rebellious case in front of me!”</p>\n        <p>I stood silently, with my heart pounding and a quick breath, open-mouthed in awe of this scene I was being part of. “I didn’t know all those actions would entitle such big consequences!”</p>\n        <p>“Ignorance of the law excuses no one.” Her every word struck me like a sharp needle.</p>\n        <p>“Well, yes, I might’ve told some lies, and eaten a few donuts more than I should’ve, but I haven’t been <em>bad</em> bad, right?” The two women looked at me, with inexpressive faces. “Or, at least, I was going to take a turn for the better at any moment!”</p>\n        <p>“Isn’t that what you’ve been telling yourself for the last seven years, Ms. Kingston?”</p>\n        <p>“Well… maybe.” I was getting scared. “What’s the point of it all? Why aren’t we told to be good <em>before</em> dying?”</p>\n        <p>“Weren’t you? By your parents and teachers?”</p>\n        <p>“Yeah, but, why not by like, God or someone?”</p>\n        <p>“God has nothing to do with this. You swore to yourself to be a good person before being born, and you’ve broken that oath innumerable times. Or, about twelve thousand times, actually.”</p>\n        <p>“But… I didn’t know any of this during my lifetime!”</p>\n        <p>As I finished that sentence, I broke down to tears. The lawyer rolled her eyes, whereas the judge was getting angrier by the second.</p>\n        <p>“You know,” she responded, “your mother was right about you. No wonder she kicked you out of the house.”</p>\n        <p>But with those words, amid the desolation, my mind cleared up and I raised my head in realization of the truth. “This trial”, I muttered, holding back my tears. “It’s not fair. You claim that I’m the best person to judge myself, but… I’m the worst at that. I’m always too critical, too harsh on my own behavior. I could never be fair to me. Just look!” I pointed at the lawyer. “There’s me with a stack of papers full of arguments and reasons to condemn me! And, your honor, with all due respect, you are here to make a cold evaluation of my acts, just matching them against some contract I don’t even remember signing.” I stood up, enraged. “And who’s defending <em>me</em>?”</p>\n        <p>“Well, of course, yourself,” she made a gesture towards me with her hand open.</p>\n        <p>“Exactly! Why do <em>I</em> get to be judged? Whoever designed this system is clearly biased against me!”</p>\n        <p>“Ms. Kingston, you designed this system yourself—”</p>\n        <p>“Of course I did. See?!”</p>\n        <p>“Enough! I’m having none of it. Ms. Kingston, I’ve heard all I needed to hear. It is clear to me that it’s too late for you to learn the concept of guilt. I therefore condemn you—”</p>\n        <p>“You have to listen to me! I can be a good person! Just not like this, I need an opportunity. I can’t go to hell!”</p>\n        <p>“You’re not going to hell. A way more proportional punishment is being sent back to your sad, old life.”</p>\n        <p>And with the conclusive strike of her gavel, the omnipresent white vanished before I even had the chance to open my mouth.</p>\n        <hr style=\"border-color: black; width: 50px;\" />\n        <p>“Oi, mate.” The voice of a pig-faced cockney crouching before me wakes me up. “We almost thought you overdosed. I’ve never seen someone do that much coke all in one sitting!”</p>\n        <p>“Stand back, you fucking moron,” I abruptly push him away, as I get up from the floor. “I gotta go buy flowers for my mother’s grave.”</p>\n      </div>\n      <figcaption>Text by Xavier Ripoll</figcaption>\n    </div>\n  </div>\n</div>","metadata":{"title":"The Trial","slug":"the-trial","date":"2019-12-03T00:00:00.000Z","tags":null,"summary":null},"filename":"20191203-the-trial.md","path":"/home/runner/work/website/website/src/routes/blog/_posts/20191203-the-trial.md"}