{"html":"<p>This text is a short portrait of my feelings on the intersection of two interesting topics, both related to the way our brains work.</p>\n<h2 id=\"the-voice\">The voice</h2>\n<p>Do you hear a voice inside your head that reads your thoughts?</p>\n<p>Okay, maybe that was too much to begin with. What about this: when you read, do you hear the sounds of the words inside your head?</p>\n<p>If your answer is \"I'm not sure\", chances are you don't. Or so claimed one of the co-hosts of the podcast <a href=\"http://www.hellointernet.fm/\">Hello Internet</a> as he posed this same question to his mate in an episode back in 2015 (<a href=\"http://www.hellointernet.fm/podcast/51\">episode 51</a>, around the 1:44:10 mark).</p>\n<p>The act of internally voicing the information that travels through your consciousness is called <a href=\"https://en.wikipedia.org/wiki/Subvocalization\">subvocalization</a>. Although the term is typically applied to speaking internally while reading, in this post we will extend it to encompass the act of representing any ideas as speech in your head.</p>\n<p>I can clearly visualize the moment I was listening to this episode of the podcast. It was about three years ago; I was taking a stroll by myself in Barcelona downtown. I remember, back then, having a specific (albeit unclear) answer to whether or not I subvocalized: \"I kind of do now, but I remember I didn't use to\".</p>\n<h2 id=\"the-memory\">The memory</h2>\n<p>This is where we dive into dangerous territory: memories.</p>\n<p>Thinking about this is a mess for me. Do I subvocalize? I remember some moment in the past when I know I didn't. Or do I? Maybe, I rather remember <em>remembering</em> some moment when I didn't. Or maybe what I remember is <em>remembering remembering</em>… et cetera, et cetera.</p>\n<p>My personal belief right now is that I <em>am</em> capable of thought without inner speech, but, as I grow, it becomes harder and harder to execute the act of thinking without shaping my thoughts through words. This fact worries me to some extent: I do believe that the power of the mind can not be fully harnessed purely via speech.</p>\n<p>When I find myself stuck with a problem, I may go a big deal without using words in my head, but, as I become self-conscious, I begin to use words to treat the issue. And I think this slows me down somewhat.</p>\n<p>A similar problem discussed in cognitive science is the <a href=\"https://www.youtube.com/watch?v=ktkjUjcZid0\">cognitive tradeoff hypothesis</a>, which argues that, in order to develop language, us humans had to give up some capacity of immediate memory. Similarly, I intuit that my internalization of language as I grew as a kid has diminished my capacity for abstract wordless thought.</p>\n<p>This may just as well be paranoia, but I can't shake off the idea that I'm on the edge of completely losing a very powerful tool.</p>\n<h2 id=\"the-afterthought\">The afterthought</h2>\n<p>I've often heard (from non scientific sources, though) that memories change as we revisit them, reinforcing our biases.</p>\n<p>In a similar vein, internal monologue may have this \"non-observable\" effect: when one thinks whether they subvocalize their thoughts or not, they can't avoid but do it then, kind of like when someone reminds you of breathing and you begin to breathe manually.</p>\n<p>These two phenomena (memories and inner speech) have this trait in common: the mere act of <em>observing</em> them may change their outcome. And, in changing the outcome, we may be changing our own behaviors.</p>\n<p>Obviously, when people are born, they are not capable of using language to think. Does speech make us smarter? It gives us the capacity to abstract complex ideas, but, maybe it lessens our raw power.</p>\n<p>After all, a bike will move you faster, but it will also greatly hinder the ways you can move.</p>","metadata":{"title":"Voice and Memory","slug":"voice-and-memory","date":"2019-01-30T00:00:00.000Z","tags":null},"filename":"20190126-voice-and-memory.md","path":"/home/runner/work/website/website/src/routes/blog/_posts/20190126-voice-and-memory.md"}